:PROPERTIES:
:ID:       c75cd36b-4d43-42e6-806e-450433a0c3f9
:END:
#+TITLE: FRC
#+DESCRIPTION:

Some generic notes about the FRC community/ecosystem

*** allwpilib/wpimath

#+begin_src sh :results output verbatim
locate /data/ecto/frc/wpilibsuite/allwpilib/*.proto
#+end_src

#+RESULTS:
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/controller.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/geometry2d.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/geometry3d.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/kinematics.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/plant.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/spline.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/system.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/trajectory.proto
: /data/ecto/frc/wpilibsuite/allwpilib/wpimath/src/main/proto/wpimath.proto


